Revit 2024 API
FillPattern Methods
The FillPattern type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
ExpandDots
 Corrects pattern dots to make them be drawn properly for Revit.
GetFillGrid
 Gets the specified fill grid.
GetFillGrids
 Gets all fill grids in this fill pattern
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern.
SetFillGrid
 Sets the fill grid.
SetFillGrids
 Set the fill grids in this fill pattern.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FillPattern Class
Autodesk.Revit.DB Namespace